import PageTitle from "@/components/PageTitle";
import { getLang } from "@/lib/getLang";
import React from "react";

const page = async () => {
  const faLang = (await getLang()) === "FA";
  const lang = await getLang();

  return (
    <div className="space-y-8">
      <PageTitle lang={lang} titleEn="About Us" titleFa="درباره ما" />

      <p>
        شرکت چینی نور با سال‌ها تجربه در صنعت چینی و ظروف آشپزخانه، فعالیت خود
        را با هدف ارائه محصولاتی با کیفیت، زیبا و بادوام آغاز کرد. ما با
        بهره‌گیری از دانش روز، طراحی‌های نوآورانه و همکاری با برترین
        تولیدکنندگان داخلی و خارجی، تلاش می‌کنیم تا بهترین تجربه را برای مشتریان
        خود فراهم کنیم. ما در چینی نور معتقدیم که ظروف، فقط وسایلی برای سرو غذا
        نیستند؛ بلکه بخشی از سبک زندگی و زیبایی میز غذا هستند. به همین دلیل،
        محصولات ما ترکیبی از هنر، فرهنگ و عملکرد هستند که در کنار هم، پاسخگوی
        سلیقه‌های گوناگون مشتریان خواهند بود. ماموریت ما ارائه مجموعه‌ای متنوع
        از ظروف چینی با کیفیت بالا و طراحی منحصر به‌فرد، در راستای جلب رضایت
        مشتریان و ارتقای فرهنگ میزبانی در خانه‌های ایرانی. ارزش‌های ما کیفیت
        بی‌نظیر طراحی هنرمندانه احترام به سلیقه مشتری صداقت در فروش و خدمات ما
        از همراهی شما افتخار می‌کنیم و همواره آماده‌ایم با پیشنهادات و نظرات
        ارزشمندتان، مسیر رشد و تعالی خود را هموارتر کنیم.
      </p>
    </div>
  );
};

export default page;
